test/loadTesting/load-test.yml
config:
  target: "http://localhost:3000"
  phases:
    # - duration: 30
    #   arrivalRate: 10
    #   name: "10 users per second"
    # - duration: 30
    #   arrivalRate: 20
    #   rampTo: 100
    #   name: "20 ramp to 100 users per second"
    - duration: 10
      arrivalRate: 10
      name: "1000 users per second"

scenarios:
  - name: "GET Each endpoint"
    flow:
      - loop:
        - get:
            url: "/products/?count=1000&page=200000"
            count: 10
        - get:
            url: "/products/1000011"
            count: 10
        - get:
            url: "/products/1000011/styles"
            count: 10
        - get:
            url: "/products/1000011/related"
            count: 10